app/controllers/students_controller.rb

  def show
    @students = Student.create_with(first_name: nil , last_name: nil )
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]